problems/publication_level_cases/manuBench/st1.5/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (-1   -0.5      -1)//0
        ( 0   -0.5      -1)//1
        ( 0    0.5      -1)//2
        (-1    0.5      -1)//3
        (-1   -0.5       0)//4
        ( 0   -0.5       0)//5
        ( 0    0.5       0)//6
        (-1    0.5       0)//7
        ( 1   -0.5      -1)//8
        ( 1    0.5      -1)//9
        ( 1   -0.5       0)//10
        ( 1    0.5       0)//11
        (-1   -0.5       1)//12
        ( 0   -0.5       1)//13
        ( 0    0.5       1)//14
        (-1    0.5       1)//15
        ( 1   -0.5       1)//16
        ( 1    0.5       1)//17
);

blocks
(
     hex (0 1 2 3 4 5 6 7)          (100 1 100) simpleGrading (2.5 1 2.5)
     hex (1 8 9 2 5 10 11 6)        (100 1 100) simpleGrading (0.4 1 2.5)
     hex (4 5 6 7 12 13 14 15)      (100 1 100) simpleGrading (2.5 1 0.4)
     hex (5 10 11 6 13 16 17 14)    (100 1 100) simpleGrading (0.4 1 0.4)
);

edges
(
);

patches
(
    wall movingWall
    (
        (12 13 14 15)
        (13 16 17 14)
    )
    wall bottomWall
    (
        (0 1 2 3)
        (1 8 9 2)
    )
    wall rightWall
    (
        (8 9 11 10)
        (10 11 17 16)
    )
    wall leftWall
    (
        (0 3 7 4)
        (4 7 15 12)
    )
    empty frontPlane
    (
        (0 1 5 4)
        (1 8 10 5)
        (4 5 13 12)
        (5 10 16 13)
    )
    empty backPlane
    (
        (3 2 6 7)
        (2 9 11 6)
        (7 6 14 15)
        (6 11 17 14)
    )    
);



// ************************************************************************* //
