problems/publication_level_cases/manuBench/st1.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    movingWall
    {
        type            wall;
        nFaces          200;
        startFace       79600;
    }
    bottomWall
    {
        type            wall;
        nFaces          200;
        startFace       79800;
    }
    rightWall
    {
        type            wall;
        nFaces          200;
        startFace       80000;
    }
    leftWall
    {
        type            wall;
        nFaces          200;
        startFace       80200;
    }
    frontPlane
    {
        type            empty;
        nFaces          40000;
        startFace       80400;
    }
    backPlane
    {
        type            empty;
        nFaces          40000;
        startFace       120400;
    }
)

// ************************************************************************* //
