problems/publication_level_cases/manuBench/st1.5/constant/c1u5_crossSections_invscatt

/*
crossSection dictionary
Generatd by "serpentToFoamXS"
24-Mar-2015
From SERPENT results file: c1u5_res
*/

/*
SERPENT run information:
TITLE: bench1u5
SERPENT VERSION: Serpent 2.1.22
START_DATE: Mon Mar 23 16:49:50 2015
COMPLETE_DATE: Tue Mar 24 09:45:16 2015 
*/

/*
physical delayed neutron fraction and spectrum
*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      crossSections;
}

inverseNeutronVelocity "1|v" [ 0 -1 1 0 0 0 0 ] ( 4.005000e-08 7.396750e-08 2.618560e-07 6.695430e-07 1.559910e-06 4.260090e-06 );

D               D [ 0 1 0 0 0 0 0 ] ( 2.793540e-02 1.835070e-02 1.128720e-02 1.446010e-02 1.393240e-02 1.280960e-02 );

sigma_a         sigma_a [ 0 -1 0 0 0 0 0 ] ( 1.658420e+01 2.179980e+01 3.188930e+01 2.424680e+01 2.511260e+01 2.725540e+01 );

sigma_f         sigma_f [ 0 -1 0 0 0 0 0 ] ( 1.139120e-01 1.062450e-01 1.522420e-01 2.552220e-01 5.263570e-01 1.433880e+00 );

sigma_s         sigma_s [ 0 -1 0 0 0 0 0 ] ( 1.086030e+01 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00 5.250860e+00 1.843090e+01 0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00 4.041150e-01 3.202210e+00 2.990800e+01 0.000000e+00 0.000000e+00 0.000000e+00 1.086690e-02 2.637680e-03 1.644960e+00 2.178240e+01 0.000000e+00 0.000000e+00 2.507320e-03 2.447220e-04 1.883980e-03 1.914760e+00 2.280100e+01 0.000000e+00 3.815280e-04 1.732140e-05 1.291580e-04 7.056900e-09 1.068970e+00 2.384200e+01 );

chi_p                 chi_p [ 0 0 0 0 0 0 0 ] ( 3.533440e-01 5.241030e-01 1.210450e-01 1.349410e-03 1.507540e-04 8.001960e-06 );

chi_d                  chi_d [ 0 0 0 0 0 0 0 ] ( 4.223240e-03 3.877580e-01 5.822240e-01 2.254410e-02 2.808740e-03 4.424000e-04 );

nu_tot             nu_tot [ 0 0 0 0 0 0 0 ] ( 2.798280e+00 2.524830e+00 2.443890e+00 2.437020e+00 2.436300e+00 2.436160e+00 );

E_f              E_f [ 1 2 -2 0 0 0 0 ] ( 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 );

beta1           beta1 [ 0 0 0 0 0 0 0 ] 2.339900e-04;
beta2           beta2 [ 0 0 0 0 0 0 0 ] 1.032940e-03;
beta3           beta3 [ 0 0 0 0 0 0 0 ] 6.826350e-04;
beta4           beta4 [ 0 0 0 0 0 0 0 ] 1.377970e-03;
beta5           beta5 [ 0 0 0 0 0 0 0 ] 2.147440e-03;
beta6           beta6 [ 0 0 0 0 0 0 0 ] 6.416850e-04;
beta7           beta7 [ 0 0 0 0 0 0 0 ] 5.997660e-04;
beta8           beta8 [ 0 0 0 0 0 0 0 ] 1.651040e-04;
lam1            lam1  [ 0 0 -1 0 0 0 0 ] 1.246670e-02;
lam2            lam2  [ 0 0 -1 0 0 0 0 ] 2.829170e-02;
lam3            lam3  [ 0 0 -1 0 0 0 0 ] 4.252440e-02;
lam4            lam4  [ 0 0 -1 0 0 0 0 ] 1.330420e-01;
lam5            lam5  [ 0 0 -1 0 0 0 0 ] 2.924670e-01;
lam6            lam6  [ 0 0 -1 0 0 0 0 ] 6.664880e-01;
lam7            lam7  [ 0 0 -1 0 0 0 0 ] 1.634780e+00;
lam8            lam8  [ 0 0 -1 0 0 0 0 ] 3.554600e+00;

unoSuGamma1     unoSuGamma1 [ 0 0 0 0 0 0 0 ] ( 15.152 15.152 15.152 15.152 15.152 15.152 );

unoSuGamma2     unoSuGamma2 [ 0 0 0 0 0 0 0 ] ( 17.241 17.241 17.241 17.241 17.241 17.241 );

xsModel         alphaLogTRhok;

T_min_xs    T_min_xs [ 0 0 0 1 0 0 0 ] 6.000000e+02;
