problems/publication_level_cases/manuBench/st1.5/constant/c1u5_crossSections_samofar
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      crossSections;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inverseNeutronVelocity "1|v" [ 0 -1 1 0 0 0 0 ] ( 4.003670e-08
7.398460e-08 2.617480e-07 6.692700e-07 1.558450e-06 4.244620e-06 );

D               D [ 0 1 0 0 0 0 0 ] ( 2.800640e-02 1.840210e-02
1.131100e-02 1.447860e-02 1.397500e-02 1.282520e-02 );

diffusionCoeff  D [ 0 1 0 0 0 0 0 ] ( 2.800640e-02 1.840210e-02
1.131100e-02 1.447860e-02 1.397500e-02 1.282520e-02 );

sigma_a         sigma_a [ 0 -1 0 0 0 0 0 ] ( 1.655120e+01 2.172530e+01
3.180090e+01 2.420930e+01 2.503510e+01 2.721590e+01 );

sigma_f         sigma_f [ 0 -1 0 0 0 0 0 ] ( 1.113090e-01 1.086820e-01
1.522190e-01 2.581900e-01 5.363260e-01 1.449170e+00 );

//sigma_s_is         sigma_s_is [ 0 -1 0 0 0 0 0 ] ( 1.084760e+01
5.233160e+00 4.018050e-01 1.098690e-02 2.532900e-03 3.783340e-04
0.000000e+00 1.836660e+01 3.191380e+00 2.342180e-03 2.252590e-04
2.004050e-05 0.000000e+00 0.000000e+00 2.982930e+01 1.634700e+00
1.705750e-03 1.246250e-04 0.000000e+00 0.000000e+00 0.000000e+00
2.174720e+01 1.902430e+00 1.368580e-06 0.000000e+00 0.000000e+00
0.000000e+00 0.000000e+00 2.271730e+01 1.058850e+00 0.000000e+00
0.000000e+00 0.000000e+00 0.000000e+00 0.000000e+00 2.378260e+01 );

sigma_s         sigma_s [ 0 -1 0 0 0 0 0 ] (
   1.08476000000000e+01   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00
   5.23316000000000e+00   1.83666000000000e+01   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00
   4.01805000000000e-01   3.19138000000000e+00   2.98293000000000e+01   0.00000000000000e+00   0.00000000000000e+00   0.00000000000000e+00
   1.09869000000000e-02   2.34218000000000e-03   1.63470000000000e+00   2.17472000000000e+01   0.00000000000000e+00   0.00000000000000e+00
   2.53290000000000e-03   2.25259000000000e-04   1.70575000000000e-03   1.90243000000000e+00   2.27173000000000e+01   0.00000000000000e+00
   3.78334000000000e-04   2.00405000000000e-05   1.24625000000000e-04   1.36858000000000e-06   1.05885000000000e+00   2.37826000000000e+01);

chi_p                 chi_p [ 0 0 0 0 0 0 0 ] ( 3.538120e-01
5.236420e-01 1.210330e-01 1.354570e-03 1.512260e-04 7.372360e-06 );

chi_d                 chi_d [ 0 0 0 0 0 0 0 ] ( 4.303250e-03
3.877340e-01 5.818480e-01 2.279470e-02 2.891300e-03 4.289350e-04 );

nu_tot             nu_tot [ 0 0 0 0 0 0 0 ] ( 2.855170e+00
2.545320e+00 2.433280e+00 2.431270e+00 2.433300e+00 2.433300e+00 );

E_f              E_f [ 1 2 -2 0 0 0 0 ] ( 3.240722e-11 3.240722e-11
3.240722e-11 3.240722e-11 3.240722e-11 3.240722e-11 );

beta1           beta1 [ 0 0 0 0 0 0 0 ] 2.331020e-04;

beta2           beta2 [ 0 0 0 0 0 0 0 ] 1.032620e-03;

beta3           beta3 [ 0 0 0 0 0 0 0 ] 6.818780e-04;

beta4           beta4 [ 0 0 0 0 0 0 0 ] 1.377260e-03;

beta5           beta5 [ 0 0 0 0 0 0 0 ] 2.144930e-03;

beta6           beta6 [ 0 0 0 0 0 0 0 ] 6.409170e-04;

beta7           beta7 [ 0 0 0 0 0 0 0 ] 6.058050e-04;

beta8           beta8 [ 0 0 0 0 0 0 0 ] 1.660160e-04;

lam1            lam1  [ 0 0 -1 0 0 0 0 ] 1.246670e-02;

lam2            lam2  [ 0 0 -1 0 0 0 0 ] 2.829170e-02;

lam3            lam3  [ 0 0 -1 0 0 0 0 ] 4.252440e-02;

lam4            lam4  [ 0 0 -1 0 0 0 0 ] 1.330420e-01;

lam5            lam5  [ 0 0 -1 0 0 0 0 ] 2.924670e-01;

lam6            lam6  [ 0 0 -1 0 0 0 0 ] 6.664880e-01;

lam7            lam7  [ 0 0 -1 0 0 0 0 ] 1.634780e+00;

lam8            lam8  [ 0 0 -1 0 0 0 0 ] 3.554600e+00;

xsModel         alphaLogTRhok;

unoSuGamma1     unoSuGamma1 [ 0 0 0 0 0 0 0 ] ( 15.152 15.152 15.152
15.152 15.152 15.152 );

unoSuGamma2     unoSuGamma2 [ 0 0 0 0 0 0 0 ] ( 17.241 17.241 17.241
17.241 17.241 17.241 );

T_min_xs        T_min_xs [ 0 0 0 1 0 0 0 ] 600;

T_ref_xs        T_ref_xs [ 0 0 0 1 0 0 0 ] 900;

D_alpha         D_alpha [ 0 1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_a_alpha   sigma_a_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_f_alpha   sigma_f_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_s_alpha   sigma_s_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 );

chi_p_alpha     chi_p_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

chi_d_alpha     chi_d_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

nu_tot_alpha    nu_tot_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

E_f_alpha       E_f_alpha [ 1 2 -2 0 0 0 0 ] ( 0 0 0 0 0 0 );

decLam1         decLam1 [ 0 0 -1 0 0 0 0 ] 1;

decLam2         decLam2 [ 0 0 -1 0 0 0 0 ] 1;

decLam3         decLam3 [ 0 0 -1 0 0 0 0 ] 1;

decBeta1        decBeta1 [ 0 0 0 0 0 0 0 ] 0;

decBeta2        decBeta2 [ 0 0 0 0 0 0 0 ] 0;

decBeta3        decBeta3 [ 0 0 0 0 0 0 0 ] 0;


// ************************************************************************* //
