problems/publication_level_cases/manuBench/st1.5/constant/crossSections
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      crossSections;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inverseNeutronVelocity "1|v" [ 0 -1 1 0 0 0 0 ] ( 4.00367e-08 7.39846e-08 2.61748e-07 6.6927e-07 1.55845e-06 4.24462e-06 );

D               D [ 0 1 0 0 0 0 0 ] ( 0.0280064 0.0184021 0.011311 0.0144786 0.013975 0.0128252 );

diffusionCoeff  D [ 0 1 0 0 0 0 0 ] ( 0.0280064 0.0184021 0.011311 0.0144786 0.013975 0.0128252 );

sigma_a         sigma_a [ 0 -1 0 0 0 0 0 ] ( 16.5512 21.7253 31.8009 24.2093 25.0351 27.2159 );

sigma_f         sigma_f [ 0 -1 0 0 0 0 0 ] ( 0.111309 0.108682 0.152219 0.25819 0.536326 1.44917 );

sigma_s         sigma_s [ 0 -1 0 0 0 0 0 ] ( 10.8476 0 0 0 0 0 5.23316 18.3666 0 0 0 0 0.401805 3.19138 29.8293 0 0 0 0.0109869 0.00234218 1.6347 21.7472 0 0 0.0025329 0.000225259 0.00170575 1.90243 22.7173 0 0.000378334 2.00405e-05 0.000124625 1.36858e-06 1.05885 23.7826 );

chi_p           chi_p [ 0 0 0 0 0 0 0 ] ( 0.353812 0.523642 0.121033 0.00135457 0.000151226 7.37236e-06 );

chi_d           chi_d [ 0 0 0 0 0 0 0 ] ( 0.00430325 0.387734 0.581848 0.0227947 0.0028913 0.000428935 );

nu_tot          nu_tot [ 0 0 0 0 0 0 0 ] ( 2.85517 2.54532 2.43328 2.43127 2.4333 2.4333 );

E_f             E_f [ 1 2 -2 0 0 0 0 ] ( 3.240722e-11 3.240722e-11 3.240722e-11 3.240722e-11 3.240722e-11 3.240722e-11 );

beta1           beta1 [ 0 0 0 0 0 0 0 ] 0.000233102;

beta2           beta2 [ 0 0 0 0 0 0 0 ] 0.00103262;

beta3           beta3 [ 0 0 0 0 0 0 0 ] 0.000681878;

beta4           beta4 [ 0 0 0 0 0 0 0 ] 0.00137726;

beta5           beta5 [ 0 0 0 0 0 0 0 ] 0.00214493;

beta6           beta6 [ 0 0 0 0 0 0 0 ] 0.000640917;

beta7           beta7 [ 0 0 0 0 0 0 0 ] 0.000605805;

beta8           beta8 [ 0 0 0 0 0 0 0 ] 0.000166016;

lam1            lam1 [ 0 0 -1 0 0 0 0 ] 0.0124667;

lam2            lam2 [ 0 0 -1 0 0 0 0 ] 0.0282917;

lam3            lam3 [ 0 0 -1 0 0 0 0 ] 0.0425244;

lam4            lam4 [ 0 0 -1 0 0 0 0 ] 0.133042;

lam5            lam5 [ 0 0 -1 0 0 0 0 ] 0.292467;

lam6            lam6 [ 0 0 -1 0 0 0 0 ] 0.666488;

lam7            lam7 [ 0 0 -1 0 0 0 0 ] 1.63478;

lam8            lam8 [ 0 0 -1 0 0 0 0 ] 3.5546;

xsModel         alphaLogTRhok;

unoSuGamma1     unoSuGamma1 [ 0 0 0 0 0 0 0 ] ( 15.152 15.152 15.152 15.152 15.152 15.152 );

unoSuGamma2     unoSuGamma2 [ 0 0 0 0 0 0 0 ] ( 17.241 17.241 17.241 17.241 17.241 17.241 );

T_min_xs        T_min_xs [ 0 0 0 1 0 0 0 ] 600;

T_ref_xs        T_ref_xs [ 0 0 0 1 0 0 0 ] 900;

D_alpha         D_alpha [ 0 1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_a_alpha   sigma_a_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_f_alpha   sigma_f_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_s_alpha   sigma_s_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 );

chi_p_alpha     chi_p_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

chi_d_alpha     chi_d_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

nu_tot_alpha    nu_tot_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

E_f_alpha       E_f_alpha [ 1 2 -2 0 0 0 0 ] ( 0 0 0 0 0 0 );

decLam1         decLam1 [ 0 0 -1 0 0 0 0 ] 1;

decLam2         decLam2 [ 0 0 -1 0 0 0 0 ] 1;

decLam3         decLam3 [ 0 0 -1 0 0 0 0 ] 1;

decBeta1        decBeta1 [ 0 0 0 0 0 0 0 ] 0;

decBeta2        decBeta2 [ 0 0 0 0 0 0 0 ] 0;

decBeta3        decBeta3 [ 0 0 0 0 0 0 0 ] 0;


// ************************************************************************* //
