problems/publication_level_cases/manuBench/st1.5/constant/crossSections_pres
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      crossSections;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inverseNeutronVelocity "1|v" [ 0 -1 1 0 0 0 0 ] ( 4.005e-08 7.39675e-08 2.61856e-07 6.69543e-07 1.55991e-06 4.26008e-06 );

D               D [ 0 1 0 0 0 0 0 ] ( 0.0279354 0.0183507 0.0112872 0.0144601 0.0139324 0.0128096 );

diffusionCoeff  D [ 0 1 0 0 0 0 0 ] ( 0.0279354 0.0183507 0.0112872 0.0144601 0.0139324 0.0128096 );

sigma_a         sigma_a [ 0 -1 0 0 0 0 0 ] ( 16.5842 21.7998 31.8893 24.2468 25.1126 27.2553 );

sigma_f         sigma_f [ 0 -1 0 0 0 0 0 ] ( 0.113912 0.106245 0.152242 0.255221 0.526356 1.43388 );

sigma_s_is      sigma_s_is [ 0 -1 0 0 0 0 0 ] ( 10.8603 5.25084 0.404127 0.0108658 0.00250725 0.000381385 0 18.4309 3.20221 0.00263731 0.000244782 1.7302e-05 0 0 29.908 1.64496 0.00188417 0.000129165 0 0 0 21.7824 1.91476 7.11017e-09 0 0 0 0 22.801 1.06897 0 0 0 0 0 23.842 );

sigma_s         sigma_s [ 0 -1 0 0 0 0 0 ] ( 10.8603 0 0 0 0 0 5.25086 18.4309 0 0 0 0 0.404115 3.20221 29.908 0 0 0 0.0108669 0.00263768 1.64496 21.7824 0 0 0.00250732 0.000244722 0.00188398 1.91476 22.801 0 0.000381528 1.73214e-05 0.000129158 7.0569e-09 1.06897 23.842 );

chi_p           chi_p [ 0 0 0 0 0 0 0 ] ( 0.353344 0.524102 0.121045 0.00134941 0.000150743 8.00821e-06 );

chi_d           chi_d [ 0 0 0 0 0 0 0 ] ( 0.0042213 0.38776 0.582222 0.0225436 0.00281038 0.00044302 );

nu_tot          nu_tot [ 0 0 0 0 0 0 0 ] ( 2.79828 2.52483 2.44389 2.43702 2.4363 2.43616 );

E_f             E_f [ 1 2 -2 0 0 0 0 ] ( 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 3.236765e-11 );

beta1           beta1 [ 0 0 0 0 0 0 0 ] 0.000234005;

beta2           beta2 [ 0 0 0 0 0 0 0 ] 0.001033;

beta3           beta3 [ 0 0 0 0 0 0 0 ] 0.000682624;

beta4           beta4 [ 0 0 0 0 0 0 0 ] 0.00137808;

beta5           beta5 [ 0 0 0 0 0 0 0 ] 0.00214723;

beta6           beta6 [ 0 0 0 0 0 0 0 ] 0.000641624;

beta7           beta7 [ 0 0 0 0 0 0 0 ] 0.000599738;

beta8           beta8 [ 0 0 0 0 0 0 0 ] 0.000165145;

lam1            lam1 [ 0 0 -1 0 0 0 0 ] 0.0124667;

lam2            lam2 [ 0 0 -1 0 0 0 0 ] 0.0282917;

lam3            lam3 [ 0 0 -1 0 0 0 0 ] 0.0425244;

lam4            lam4 [ 0 0 -1 0 0 0 0 ] 0.133042;

lam5            lam5 [ 0 0 -1 0 0 0 0 ] 0.292467;

lam6            lam6 [ 0 0 -1 0 0 0 0 ] 0.666488;

lam7            lam7 [ 0 0 -1 0 0 0 0 ] 1.63478;

lam8            lam8 [ 0 0 -1 0 0 0 0 ] 3.5546;

unoSuGamma1     unoSuGamma1 [ 0 0 0 0 0 0 0 ] ( 15.152 15.152 15.152 15.152 15.152 15.152 );

unoSuGamma2     unoSuGamma2 [ 0 0 0 0 0 0 0 ] ( 17.241 17.241 17.241 17.241 17.241 17.241 );

xsModel         alphaLogTRhok;

T_min_xs        T_min_xs [ 0 0 0 1 0 0 0 ] 600;

T_ref_xs        T_ref_xs [ 0 0 0 1 0 0 0 ] 900;

D_alpha         D_alpha [ 0 1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_a_alpha   sigma_a_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_f_alpha   sigma_f_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

sigma_s_alpha   sigma_s_alpha [ 0 -1 0 0 0 0 0 ] ( 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 );

chi_p_alpha     chi_p_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

chi_d_alpha     chi_d_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

nu_tot_alpha    nu_tot_alpha [ 0 0 0 0 0 0 0 ] ( 0 0 0 0 0 0 );

E_f_alpha       E_f_alpha [ 1 2 -2 0 0 0 0 ] ( 0 0 0 0 0 0 );

decLam1         decLam1 [ 0 0 -1 0 0 0 0 ] 1;

decLam2         decLam2 [ 0 0 -1 0 0 0 0 ] 1;

decLam3         decLam3 [ 0 0 -1 0 0 0 0 ] 1;

decBeta1        decBeta1 [ 0 0 0 0 0 0 0 ] 0;

decBeta2        decBeta2 [ 0 0 0 0 0 0 0 ] 0;

decBeta3        decBeta3 [ 0 0 0 0 0 0 0 ] 0;


// ************************************************************************* //
