problems/publication_level_cases/manuBench/st1.5/constant/pumpHexProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pumpHexProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TCold           TCold [ 0 0 0 1 0 0 0 ] 900;

hHEX            hHEX [ 1 -1 -3 -1 0 0 0 ] 1000000;


// ************************************************************************* //
