problems/publication_level_cases/manuBench/st1.5/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] 0.025;

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 2e-04;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 900;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 3.075e+05;

// Laminar Schmidt number
Sc              Sc [0 0 0 0 0 0 0] 2e+08;

//rhoCp
rhoCp           rhoCp [1 -1 -2 -1 0 0 0] 6.15e6;

// ************************************************************************* //
