problems/publication_level_cases/manuBench/st1.5/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "4000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
40000
(
(-1.77080139e-06 0 1.77202592e-06)
(-7.05493203e-06 0 2.17349553e-06)
(-1.08299048e-05 0 1.53400432e-06)
(-1.02483869e-05 0 4.72846542e-07)
(-3.81056677e-06 0 -6.95422248e-07)
(8.93728008e-06 0 -1.84299725e-06)
(2.80003235e-05 0 -2.90999385e-06)
(5.31466352e-05 0 -3.87415605e-06)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leftWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
