problems/publication_level_cases/manuBench/st1.5/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
7.95322464e-10
2.86986155e-05
0.000123332328
0.000278149045
0.000474303576
0.000695582676
0.000928177928
0.00116047113
...
)
;

boundaryField
{
    movingWall
    {
        type            buoyantPressure;
        gradient        nonuniform List<scalar> 
200
(
-9.80660601
-9.80598819
-9.80536569
-9.80472544
-9.80405612
-9.80336993
-9.80267239
-9.80195988
...
)
;
        rho             rhok;
        value           nonuniform List<scalar> 
200
(
-18.6131936
-18.6132861
-18.6135443
-18.6139413
-18.6144211
-18.6149377
-18.6154535
-18.6159382
...
)
;
    }
    bottomWall
    {
        type            buoyantPressure;
        gradient        nonuniform List<scalar> 
200
(
9.80664462
9.80602478
9.80539442
9.80475922
9.80411835
9.80346884
9.80282179
9.80217333
...
)
;
        rho             rhok;
        value           nonuniform List<scalar> 
200
(
0.0299315934
0.0299583994
0.0300511091
0.0302039871
0.0303981855
0.0306174822
0.0308481026
0.0310784166
...
)
;
    }
    rightWall
    {
        type            buoyantPressure;
        gradient        uniform 0;
        rho             rhok;
        value           nonuniform List<scalar> 
200
(
2.92095114e-07
-0.0601681095
-0.120957641
-0.182367337
-0.244382987
-0.306992892
-0.370187622
-0.433959828
...
)
;
    }
    leftWall
    {
        type            buoyantPressure;
        gradient        uniform 0;
        rho             rhok;
        value           nonuniform List<scalar> 
200
(
7.95322464e-10
-0.0601684005
-0.120957932
-0.182367628
-0.244383278
-0.306993183
-0.370187911
-0.433960118
...
)
;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
