problems/publication_level_cases/manuBench/st1.5/0/betaValues
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "4000";
    object      betaValues;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beta1_eff       beta1_eff [ 0 0 0 0 0 0 0 ] 0.000185153514;

beta2_eff       beta2_eff [ 0 0 0 0 0 0 0 ] 0.000837669377;

beta3_eff       beta3_eff [ 0 0 0 0 0 0 0 ] 0.000560127355;

beta4_eff       beta4_eff [ 0 0 0 0 0 0 0 ] 0.00120542443;

beta5_eff       beta5_eff [ 0 0 0 0 0 0 0 ] 0.00199766231;

beta6_eff       beta6_eff [ 0 0 0 0 0 0 0 ] 0.000622770723;

beta7_eff       beta7_eff [ 0 0 0 0 0 0 0 ] 0.000597618812;

beta8_eff       beta8_eff [ 0 0 0 0 0 0 0 ] 0.0001642607;

betaTOT_eff     betaTOT_eff [ 0 0 0 0 0 0 0 ] 0.00617068722;


// ************************************************************************* //
