problems/publication_level_cases/manuBench/st1.5/0/delayedNeutronSource
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      delayedNeutronSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
8.95688453e+14
1.06387092e+15
1.23215155e+15
1.40210495e+15
1.57527548e+15
1.75408564e+15
1.93170763e+15
2.11037587e+15
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
9.07488408e+14
1.07285797e+15
1.23467427e+15
1.40408012e+15
1.59614822e+15
1.8127679e+15
2.04316626e+15
2.28438109e+15
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
8.95688453e+14
1.06387092e+15
1.23215155e+15
1.40210495e+15
1.57527548e+15
1.75408564e+15
1.93170763e+15
2.11037587e+15
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
8.95685896e+14
1.06127158e+15
1.2260246e+15
1.39353053e+15
1.56628388e+15
1.7474885e+15
1.93190373e+15
2.12229901e+15
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
8.95688453e+14
1.06127451e+15
1.22602798e+15
1.39353441e+15
1.56628833e+15
1.74749347e+15
1.93190926e+15
2.12230511e+15
...
)
;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
