problems/publication_level_cases/manuBench/st1.5/0/globalParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "4000";
    object      globalParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

totalPower      P_total [ 1 2 -3 0 0 0 0 ] 1e+09;

kEffective      keff [ 0 0 0 0 0 0 0 ] 0.993044316;

kEffective_adj  keff_adj [ 0 0 0 0 0 0 0 ] 1;


// ************************************************************************* //
