problems/publication_level_cases/manuBench/st1.5/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "4000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
79600
(
-2.50275113e-08
2.50273401e-08
-5.4848272e-08
2.98208362e-08
-6.5227982e-08
1.03797507e-08
-4.37515255e-08
-2.14764387e-08
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.69406589e-21
0
0
0
0
0
0
-1.69406589e-21
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0
1.69406589e-21
0
0
-1.69406589e-21
0
0
1.69406589e-21
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           uniform 0;
    }
    leftWall
    {
        type            calculated;
        value           uniform 0;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
