problems/publication_level_cases/manuBench/st1.5/0/prec1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      prec1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
2.4551666e+15
2.93630793e+15
3.40539083e+15
3.90285426e+15
4.49575037e+15
5.25888869e+15
6.04641401e+15
6.88441791e+15
...
)
;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    rightWall
    {
        type            zeroGradient;
    }
    leftWall
    {
        type            zeroGradient;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
