problems/publication_level_cases/manuBench/st1.5/0/prec5_adj
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      prec5_adj;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
2.06702249e+16
2.44154168e+16
2.81794785e+16
3.19837048e+16
3.583979e+16
3.97629185e+16
4.37149805e+16
4.77099243e+16
...
)
;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    rightWall
    {
        type            zeroGradient;
    }
    leftWall
    {
        type            zeroGradient;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
