problems/publication_level_cases/manuBench/st1.5/0/prec7_adj
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      prec7_adj;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
2.0663131e+16
2.44124673e+16
2.8190763e+16
3.20018812e+16
3.58478098e+16
3.97310235e+16
4.36444928e+16
4.75904281e+16
...
)
;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    rightWall
    {
        type            zeroGradient;
    }
    leftWall
    {
        type            zeroGradient;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
