problems/publication_level_cases/manuBench/st1.5/0/promptHeatSource
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      promptHeatSource;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
1700471.91
2018227.64
2338205.64
2660427.4
2984904.04
3311638.98
3640634.96
3971885.2
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1557793.77
1848322.4
2140923.02
2435612.31
2732396.16
3031279.08
3332258.28
3635322.41
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1541920.42
1829457.1
2119021.65
2410632.45
2704298.56
3000022.14
3297804.78
3597639.51
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1541916.14
1829476.7
2119094.9
2410793.65
2704586.45
3000480.25
3298480.72
3598585.09
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1541920.42
1829481.78
2119100.79
2410800.35
2704593.98
3000488.61
3298489.93
3598595.16
...
)
;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
