problems/publication_level_cases/manuBench/st1.5/0/rhok
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "4000";
    object      rhok;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
0.999657963
0.999594779
0.999530522
0.999465771
0.999400443
0.999334234
0.999268276
0.999202175
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.999654027
0.999591049
0.999527593
0.999462328
0.9993941
0.999324151
0.999253047
0.999180415
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.999657963
0.999594779
0.999530522
0.999465771
0.999400443
0.999334234
0.999268276
0.999202175
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.999657964
0.999595242
0.999531613
0.999467193
0.999401608
0.999334523
0.999266914
0.999198396
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.999657963
0.999595241
0.999531612
0.999467192
0.999401606
0.999334521
0.999266912
0.999198393
...
)
;
    }
    frontPlane
    {
        type            empty;
    }
    backPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
