problems/publication_level_cases/manuBench/st1.5/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue pump 0
    volScalarFieldValue HEX 0
);

regions
(
    //pump
    boxToCell
    {
        box (-0.5 1.180 -1) (0.5 2.1 1);
        fieldValues
        (
            volScalarFieldValue pump 1
        );
    }
    //HEX
    boxToCell
    {
        box (-0.178 1.180 -1) (0.94 2.1 1);
        fieldValues
        (
            volScalarFieldValue HEX 1
        );
    }    
);


// ************************************************************************* //
